app/views/rooms/show.html.erb

<p>
<% @room.messages.each do |message| %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ?  [["room_id", 3]]