app/controllers/messages_controller.rb

  def new
    @room = Room.find(params[:room_id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def edit
    @room = Room.find(params[:room_id])
    @message = Message.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @room = Room.find(params[:room_id])
    #@message = Message.new(message_params)
    @message = @room.messages.new(message_params)
    #@message.user = current_user
    if @message.save
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "messages" ("content", "user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hurray!!!"], ["user_id", 10], ["room_id", 3], ["created_at", "2023-01-30 21:55:21.698910"], ["updated_at", "2023-01-30 21:55:21.698910"]]

  def update
    respond_to do |format|
      if @message.update(message_params)
---
UPDATE "messages" SET "content" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["content", "Thank God, it's all done now!!! Yay!!!!"], ["updated_at", "2023-01-30 22:11:46.753845"], ["id", 4]]