app/controllers/projects_controller.rb

INSERT INTO "projects" ("Name", "Description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    #project = Project.new(project_params)
    @project = current_user.projects.build(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "Description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["Description", "One of my projects at Qwasar"], ["updated_at", "2023-01-22 19:07:39.499940"], ["id", 17]]
---
  def update
    respond_to do |format|
      if @project.update(project_params.reject { |k| k["uploads"] })