app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "SEASON 3 BACKEND GATHER HERE"], ["created_at", "2023-01-30 10:37:04.337125"], ["updated_at", "2023-01-30 10:37:04.337125"], ["user_id", 12]]
---
  def create
    @room = current_user.rooms.build(room_params)

    respond_to do |format|
      if @room.save

DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 2]]
---
  def destroy
    @room.destroy