app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 8]]
---
  def remove
    user = User.find params[:id]
    user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "admin" = ? WHERE "users"."id" = ?  [["updated_at", "2023-01-21 23:31:23.367743"], ["admin", 1], ["id", 9]]
---
  def admin
    user = User.find params[:id]
    user.update( :admin => true)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "admin" = ? WHERE "users"."id" = ?  [["updated_at", "2023-01-21 23:37:45.103261"], ["admin", 0], ["id", 9]]
---
  def remove_admin
    user = User.find params[:id]
    user.update( :admin => false)